       01 EMPLOYEE-RECORD.
          05 EMPLOYEE-ID           PIC 9(10).
          05 EMPLOYEE-LASTNAME     PIC X(150).
          05 EMPLOYEE-FIRSTNAME    PIC X(100).
          05 EMPLOYEE-SALARY       PIC S9(7)V99 COMP-3.
          05 EMPLOYEE-DEPARTMENT   PIC X(5).
          05 EMPLOYEE-LEVEL        PIC X(2).